app/Http/Controllers/Auth/RegisteredUserController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Tim Altimimi', 'laura@gmail.com', '$2y$12$1OLzfY/BHZVVh3kqOkJ7DuVur7qG/wwjdjKQmF6ZBcgSnOwwuq7E.', '2025-03-27 04:50:11', '2025-03-27 04:50:11')
insert into `customers` (`user_id`, `first_name`, `last_name`, `updated_at`, `created_at`) values (17, 'Tim', 'Altimimi', '2025-03-27 04:52:54', '2025-03-27 04:52:54')
---
    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:' . User::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);

        event(new Registered($user));

        $customer = new Customer();
        $name = explode(" ", $request->name);
        $customer->user_id = $user->id;
        // dd($name[0]);
        // if (!isset($customer)) {
            $customer->first_name = $name[0];
            $customer->last_name = $name[1] ?? '';
            $customer->save();