app/Http/Controllers/Api/CustomerController.php

    public function index()
    {

        $perPage = request('per_page', 10);
        $search = request('search', '');
        $sortField = request('sort_field', 'updated_at');
        $sortDirection = request('sort_direction', 'desc');

        $query = Customer::query()
            ->orderBy($sortField, $sortDirection)
            ->paginate($perPage);
---
select * from `customers` order by `customers`.`updated_at` desc limit 10 offset 0
select count(*) as aggregate from `customers`

    public function countries()
    {
        return CountryResource::collection(Country::query()->orderBy('name', 'asc')->get());
---
select * from `countries` order by `name` asc