app/Http/Controllers/Api/DashboardController.php

select count(*) as aggregate from `customers` where `status` = 'active'
---
    public function activeCustomers()
    {
        return Customer::where('status', CustomerStatus::Active->value)->count();

select count(*) as aggregate from `products` where `products`.`deleted_at` is null
---
    public function activeProducts()
    {
        // TODO Implement where for active products
        return Product::count();

select count(*) as aggregate from `orders` where `status` = 'paid'
---
    public function paidOrders()
    {
        $fromDate = $this->getFromDate();
        $query = Order::query()->where('status', OrderStatus::Paid->value);

        if ($fromDate) {
            $query->where('created_at', '>', $fromDate);
        }
        return $query->count();

select sum(`total_price`) as aggregate from `orders` where `status` = 'paid'
---
    public function totalIncome()
    {

        $fromDate = $this->getFromDate();

        $query = Order::query()->where('status', OrderStatus::Paid->value);

        if ($fromDate) {
            // \Log::info('Received date param:', ['dfromDate' => $fromDate]);

            $query->where('created_at', '>', $fromDate);
        }
        return $query->sum('total_price');

select `c`.`name`, count(orders.id) as count from `orders` inner join `users` on `created_by` = `users`.`id` inner join `customer_addresses` as `a` on `users`.`id` = `a`.`customer_id` inner join `countries` as `c` on `a`.`country_code` = `c`.`code` where `status` = 'paid' and `a`.`type` = 'billing' group by `c`.`name`
---
    public function ordersByCountry()
    {
        $fromDate = $this->getFromDate();
        $query = Order::query()
            ->select(['c.name', DB::raw('count(orders.id) as count')])
            ->join('users', 'created_by', '=', 'users.id')
            ->join('customer_addresses AS a', 'users.id', '=', 'a.customer_id')
            ->join('countries AS c', 'a.country_code', '=', 'c.code')
            ->where('status', OrderStatus::Paid->value)
            ->where('a.type', AddressType::Billing->value)
            ->groupBy('c.name')
            ;

        if ($fromDate) {
            $query->where('orders.created_at', '>', $fromDate);
        }

        return $query->get();

select `id`, `first_name`, `last_name`, `u`.`email`, `phone`, `u`.`created_at` from `customers` inner join `users` as `u` on `u`.`id` = `customers`.`user_id` where `status` = 'active' order by `created_at` desc limit 5
---
    public function latestCustomers()
    {
        return Customer::query()
            ->select(['id', 'first_name', 'last_name', 'u.email', 'phone', 'u.created_at'])
            ->join('users AS u', 'u.id', '=', 'customers.user_id')
            ->where('status', CustomerStatus::Active->value)
            ->orderBy('created_at', 'desc')
            ->limit(5)
            ->get();

select `o`.`id`, `o`.`total_price`, `o`.`created_at`, COUNT(oi.id) AS items, `c`.`user_id`, `c`.`first_name`, `c`.`last_name` from `orders` as `o` inner join `order_items` as `oi` on `oi`.`order_id` = `o`.`id` inner join `customers` as `c` on `c`.`user_id` = `o`.`created_by` where `o`.`status` = 'paid' group by `o`.`id`, `o`.`total_price`, `o`.`created_at`, `c`.`user_id`, `c`.`first_name`, `c`.`last_name` order by `o`.`created_at` desc limit 10
---
    public function latestOrders()
    {
        return OrderResource::collection(
            Order::query()
                ->select(['o.id', 'o.total_price', 'o.created_at', DB::raw('COUNT(oi.id) AS items'),
                    'c.user_id', 'c.first_name', 'c.last_name'])
                ->from('orders AS o')
                ->join('order_items AS oi', 'oi.order_id', '=', 'o.id')
                ->join('customers AS c', 'c.user_id', '=', 'o.created_by')
                ->where('o.status', OrderStatus::Paid->value)
                ->limit(10)
                ->orderBy('o.created_at', 'desc')
                ->groupBy('o.id', 'o.total_price', 'o.created_at', 'c.user_id', 'c.first_name', 'c.last_name')
                ->get()
        );