app/Http/Controllers/Api/ProductController.php

select * from `products` where `title` like '%%' and `products`.`deleted_at` is null order by `updated_at` desc limit 10 offset 0
select count(*) as aggregate from `products` where `title` like '%%' and `products`.`deleted_at` is null
---
    public function index()
    {
        $perPage = request('per_page', 10);
        $search = request('search', '');
        $sortField = request('sort_field', 'updated_at');
        $sortDirection = request('sort_direction', 'desc');

        $query = Product::query()
            ->where('title', 'like', "%{$search}%")
            ->orderBy($sortField, $sortDirection)
            ->paginate($perPage);

update `products` set `image` = 'http://localhost/storage/images/kn5FSa8f4tWbvuEkv10pdUIXktoICT2Y64iqE6aA.jpg', `image_mime` = 'application/octet-stream', `image_size` = 9821, `products`.`updated_at` = '2025-03-27 05:25:25' where `id` = 1
---
    public function update(ProductRequest $request, Product $product)
    {
        $data = $request->validated();
        $data['updated_by'] = $request->user()->id;



               /** @var \Illuminate\Http\UploadedFile[] $images */
               $images = $data['images'] ?? [];
               $deletedImages = $data['deleted_images'] ?? [];


               if ($images) {
                   $this->saveImages($images , [],$product);