app/Helpers/Cart.php

select sum(`quantity`) as aggregate from `cart_items` where `user_id` = 17
---
    public static function getCartItemsCount():int {
        // return session()->has('cart') ? count(session()->get('cart')) : 0;
        $request = request();
        // $user = session()->get('user');
        $user = $request->user();
        if ($user) {
            return CartItem::where('user_id', $user->id)->sum('quantity');

select * from `cart_items` where (`user_id` = 17)
---
    public static function moveCartItemsIntoDb()
    {
        $request = \request();
        $cartItems = self::getCookieCartItems();
        $dbCartItems = CartItem::where(['user_id' => $request->user()->id])->get()->keyBy('product_id');