app/Http/Controllers/ProductController.php

    public function index(){
        $products = Product::query()->orderBy('updated_at', 'desc')->paginate(4);
---
select * from `products` where `products`.`deleted_at` is null order by `updated_at` desc limit 5 offset 0
select count(*) as aggregate from `products` where `products`.`deleted_at` is null