app/Http/Controllers/ProfileContrller.php

select * from `countries` order by `name` asc
---
    public function view(Request $request)
    {
        /**  @var \App\Models\User $user */
        $user = $request->user();
        /** @var \App\Models\Customer $customer */
        $customer = $user->customer;
        $shippingAddress = $customer->shippingAddress?: new CustomerAddress(['type' => AddressType::Shipping]);
        $billingAddress = $customer->billingAddress?: new CustomerAddress(['type' => AddressType::Billing]);
        // $billingAddress = $customer->billingAddress?: new CustomerAddress(['address_type' => AddressType::BILLING]);
        $countries = Country::query()->orderBy('name', 'asc')->get();